# def shades_of_grey(n):
#     shades = []
#     hex = '123456789abcdef'
#     counter = 0
#     for i in range(n):
#         if counter == 15:
#             counter = 0
#         gray = f"#0{hex[counter]}0{hex[counter]}0{hex[counter]}"
#         if i >= 15:
#             gray = f"#1{hex[counter]}1{hex[counter]}1{hex[counter]}"
#         shades.append(gray)
#         counter += 1

#     return shades
# print(shades_of_grey(50))

# Написать функцию, которая принимает два аргумента: n и num - и на основе них, создает список. 
# n для опрделения длины списка. num умножить на все значения в списке. Значениями списка могут быть числа, 
# которые вы получаете из цикла
    

# def num_list(n, num):
#     listnum = []
#     for i in range(n):
#         listnum.append(i * num)
#     return listnum

# print(num_list(20, 3))


# def func(a, default="hi"):
#     print(a, default)



# def func(a, b, default="hi"):
#     print("a =", a, "b =", b, default)

# func =(12,4) 
# func(b=12, a=4)

#арги












        
        
         


 

















